{"title":"frontpage","description":"I am Jacob Kristensen, and this is my portfolio.","custom_css":"frontpage.css","text_html":"      <div id=\"splash\">\r\n        <header class=\"fade_in_delayed\">\r\n            <h1>JacobSeated.com<\/h1>\r\n            <p>EPICNESS HAS ARRIVED<\/p>\r\n        <\/header>\r\n\r\n        <div id=\"profile_img_box\" class=\"fade_in_delayed\">\r\n          <div id=\"profile_img\">\r\n           <div class=\"radial_stripes\"><\/div>\r\n          <\/div>\r\n        <\/div>\r\n          <p class=\"fade_in_delayed intro_text\">I am <b>Jacob Kristensen<\/b>, and this is my portfolio.<\/p>\r\n      <\/div>\r\n\r\n      <section class=\"content_wrap fade_in_delayed width_control\">\r\n          <h2>About<\/h2>\r\n          <p>My interests are currently in technology and business, and I like to create things to solve problems and make life easier for myself and other people. Another interest i have is <i>investing<\/i> in <i>stocks<\/i>.<\/p><\/p>\r\n          <p>One day I would love to join a startup or build my own company.<\/p>\r\n          <p>This website was created to showcase some of my work. Use the top navigation to see examples of things I have made. My main projects are linked from the <a href=\"\/#projects\">My Projects<\/a> section.<\/p>\r\n      <\/section>\r\n\r\n      <section class=\"content_wrap fade_in_delayed width_control\">\r\n          <h2>My Superpowers<\/h2>\r\n          <p>I have a broad set of skills with a <b>&lt;strong&gt;<\/b> focus on coding, and most things to do with Web Development.\r\n             I am also very creative, and I know how to use several different programs for video and photo editing.<\/p>\r\n          <p>Since my main operating system is now Linux (dual boot with Windows), I have learned to use Open Source programs such as: <i>LibreOffice<\/i>, <i>OBS<\/i>, <i>Handbrake<\/i>, <i>Gimp<\/i> and <i>Kdenlive<\/i>.\r\n          But, I am also able to use \"industry standard\" Adobe CC, including <i>Photoshop<\/i>, <i>Premiere<\/i>, <i>Illustrator<\/i> and <i>InDesign<\/i>.\r\n          <p>I am also familier with <i>3D Studio MAX<\/i>, although I have not used it for many years. However, it has given me a feel with 3D modeling and Animation, which might be useful at some point.<\/p>\r\n          <p>Some years ago, I used to make animated Gifs. But, I have since moved on to animated SVGs using CSS and JavaScript.<\/p>\r\n          <p>When I work, I am usually very independent. I solve problems on my own, and come up with my own solutions.\r\n             I learned early on to use Google before asking questions. It seems like a good approach. Though sometimes it may be faster to just ask.<\/p>\r\n      <\/section>\r\n\r\n      <section class=\"content_wrap fade_in_delayed width_control\">\r\n          <h2>The History<\/h2>\r\n          <p>I started coding and creating websites as a kid, first using plain <b>notepad<\/b> in Windows, later moving on to editors with <i>Syntax Highlighting<\/i>.\r\n          Now, I mainly use Linux with <b>Eclipse<\/b> and <b>Visual Studio Code<\/b>.<\/p>\r\n\r\n          <p><b>January 2013<\/b> I decided to seak an unpaid internship for a few months as a Web Developer. Doing this time,\r\n             I was allowed to improve my existing skills with <i>HTML<\/i>, <i>CSS<\/i>, <i>JavaScript<\/i> and <i>PHP<\/i>.<\/p>\r\n          <p>In addition, I also learned more about <i>Linux<\/i>, how to use <i>AWS (Amazon Web Services)<\/i>, <i>Git<\/i>, and <i>Bootstrap<\/i>.<\/p>\r\n          <p>It was doing this time I decided to go back to school to get an education. However, first I had to finish high school, which took me a few years. This is required to join higher education in Denmark.<\/p>\r\n\r\n          <p><b>October 2017<\/b> I started studying <i>Multimedia Design and Communication<\/i> at <i>KEA<\/i> (Copenhagen School of Design and Technology),\r\n             and expect to complete my education on time.<\/p>\r\n          <p>This education has a broad focus, including many of my existing interests. Including <i>video<\/i>, <i>marketing<\/i>, <i>business<\/i>, and <i>web development<\/i>.<\/p>\r\n      <\/section>","last_modified":1539830535}