{"title":"frontpage","description":"I am Jacob Kristensen, and this is my portfolio.","custom_css":"frontpage.css","text_html":"<div id=\"splash\">\r\n  <header class=\"fade_in_delayed\">\r\n    <h1>JacobSeated.com<\/h1>\r\n    <p>[module=fp_message]<\/p>\r\n  <\/header>\r\n\r\n  <div id=\"profile_img_box\" class=\"fade_in_delayed\">\r\n    <div id=\"profile_img\">\r\n      <div class=\"radial_stripes\"><\/div>\r\n    <\/div>\r\n  <\/div>\r\n  <p class=\"fade_in_delayed intro_text\">I am <b>Jacob Kristensen<\/b>, and this is my portfolio.<\/p>\r\n<\/div>\r\n\r\n<section class=\"content_wrap fade_in_delayed width_control\">\r\n  <h2>About<\/h2>\r\n  <p>I like to create things to solve problems and make life easier for myself and for other people.<\/p>\r\n  <p>Since I like to create, and watch things grow, one day I would love to either join a startup or build my own\r\n    company.<\/p>\r\n  <p>This website was created from the ground-up to showcase some of my work, and to demonstrate my\r\n    coding-skills. The code for the CMS behind this website is available at GitHub: <a href=\"https:\/\/github.com\/jacobkri\/jacobseated.com\">https:\/\/github.com\/jacobkri\/jacobseated.com<\/a>,\r\n    and is available under Apache license. Credits for photos used on the site goes to <b>Christian Mercier<\/b>.<\/p>\r\n  <p>Use the top navigation to see examples of things I have made. <b>Highlighted Projects<\/b> can be found on the <b>Projects<\/b>\r\n    page.<\/p>\r\n<p class=\"indent\"><strong>Note.<\/strong> This site is still a work-in-progress, and I may not have included my KEA projects yet. They will likely get their own dedicated page, including information on my design-process, sketches, wireframes and other relevant stuff.<\/p>\r\n<\/section>\r\n\r\n<section class=\"content_wrap fade_in_delayed width_control\">\r\n  <h2>My Superpowers<\/h2>\r\n  <p>I have a broad set of skills with a <b>&lt;strong&gt;<\/b> focus on coding, and most things to do with Web\r\n    Development. I am also very creative, and I know how to use several different programs for video and photo editing.<\/p>\r\n  <p>Since my main operating system is now Linux (dual boot with Windows), I have learned to use Open Source programs\r\n    such as: <i>LibreOffice<\/i>, <i>OBS<\/i>, <i>Handbrake<\/i>, <i>Gimp<\/i> and <i>Kdenlive<\/i>. But, I am also able to\r\n    use \"industry standard\" Adobe CC, including <i>Photoshop<\/i>, <i>Premiere<\/i>, <i>Illustrator<\/i> and <i>InDesign<\/i>.\r\n    <p>I am also familiar with <i>3D Studio MAX<\/i>, although I have not used it for many years. However, it has given\r\n      me a feel with 3D modeling and Animation, which might be useful at some point.<\/p>\r\n    <p>Some years ago, I used to make animated Gifs. But, I have since moved on to animated SVGs using CSS and\r\n      JavaScript.<\/p>\r\n    <p>When I work, I am usually very independent. I solve problems on my own, and come up with my own solutions. I\r\n      learned early on to use Google before asking questions. It seems like a good approach. Though sometimes it may be\r\n      faster to just ask.<\/p>\r\n<\/section>\r\n\r\n<section class=\"content_wrap fade_in_delayed width_control\">\r\n  <h2>The History<\/h2>\r\n  <p>I started coding and creating websites as a kid, first using plain <b>notepad<\/b> in Windows, later moving on to\r\n    editors with <i>Syntax Highlighting<\/i>. Now, I mainly use Linux with <b>Eclipse<\/b> and <b>Visual Studio Code<\/b>.<\/p>\r\n\r\n  <p><b>January 2013<\/b> I decided to seak an unpaid internship for a few months as a Web Developer. Doing this time, I\r\n    was allowed to improve my existing skills with <i>HTML<\/i>, <i>CSS<\/i>, <i>JavaScript<\/i> and <i>PHP<\/i>.<\/p>\r\n  <p>In addition, I also learned more about <i>Linux<\/i>, how to use <i>AWS (Amazon Web Services)<\/i>, <i>Git<\/i>, and\r\n    <i>Bootstrap<\/i>.<\/p>\r\n  <p>It was doing this time I decided to go back to school to get an education. However, first I had to finish high\r\n    school, which took me a few years. This is required to join higher education in Denmark.<\/p>\r\n\r\n  <p><b>October 2017<\/b> I started studying <i>Multimedia Design and Communication<\/i> at <i>KEA<\/i> (Copenhagen School\r\n    of Design and Technology), and expect to complete my education on time.<\/p>\r\n  <p>This education has a broad focus, covering many of my existing interests. Including <i>video editing<\/i>, <i>marketing<\/i>,\r\n    <i>business<\/i>, <i>SEO<\/i> and <i>web development<\/i>.<\/p>\r\n<\/section>","last_modified":1543791012}