{"title":"KEA","description":"On this page, I show some of my projects i did doing my time at KEA.","custom_css":"kea.css","text_html":"<div class=\"width_control content_wrap\">\r\n<header>\r\n<h1>KEA<\/h1>\r\n<p>This page contains work I did while studying <b>Multimedia Design and Communication<\/b> at <i>KEA<\/i> (Copenhagen School of Design and Technology).<\/p>\r\n<\/header>\r\n\r\n<section class=\"fade_in_delayed\">\r\n<h2>ccmpixart.dk<\/h2>\r\n<ul class=\"case_topics\">\r\n <li>PHP Photo Gallery<\/li>\r\n <li>JavaScript<\/li>\r\n <li>HTML<\/li>\r\n <li>CSS<\/li>\r\n <li>PHP<\/li>\r\n<\/ul>\r\n<p><a href=\"https:\/\/ccmpixart.dk\/\" rel=\"nofollow\">Live Site<\/a><\/p>\r\n<img src=\"\/i\/ccmpixart\/ccmpixart.png\" alt=\"CCMPIXART\" class=\"case_logo\">\r\n<p>One of my friends has a Photography website, and wanted a re-design. His old site was hosted on <i>Wix<\/i>, but he wanted his own domain name, and more dynamic features.<\/p>\r\n\r\n<p>The photo gallery on the site is powered by <a href=\"https:\/\/phpphotogallery.com\/\">PHP Photo Gallery<\/a>, which is also created by me (see the Projects page).<\/p>\r\n\r\n<p>Initially the teachers only required us to make a simple static website using HTML and CSS, which I found not sufficient when working with a real client. As a result, I also ended up making a photo gallery in my spare time.<\/p>\r\n\r\n<p>We all worked on the design, but I developed the photo gallery alone, after we finished the static site.<\/p>\r\n<\/section>\r\n\r\n<section class=\"fade_in_delayed\">\r\n<h2>ladyfingers.dk<\/h2>\r\n<ul class=\"case_topics\">\r\n <li>Wordpress<\/li>\r\n <li>JavaScript<\/li>\r\n <li>JSON<\/li>\r\n <li>HTML<\/li>\r\n <li>CSS<\/li>\r\n <li>PHP<\/li>\r\n <li>Photoshop<\/li>\r\n <li>Illustrator<\/li>\r\n <li>Premiere<\/li>\r\n<\/ul>\r\n<p><a href=\"\/kea\/ladyfingers\/\" rel=\"nofollow\">Live Site<\/a> — <a href=\"?page=Ladyfingers\">The Process<\/a><\/p>\r\n<img src=\"\/i\/ladyfingers\/ladyfingers_logo-02m.png\" alt=\"Ladyfingers\" class=\"case_logo\">\r\n<p>For my second semester exam project, I worked on a website for a jewellery workshop in Copenhagen.<\/p>\r\n<p>This was a group project, and while I did much of the coding on the site, I only had little influence on the design itself.<\/p>\r\n\r\n<p>The site was using Wordpress as a <i>back-end<\/i>, and our own HTML & CSS as <i>front-end<\/i>. Personally, I think this was a fundamentally incorrect way of doing it, but it was required by KEA. I would rather have worked with plugin and template development.<\/p>\r\n\r\n<p>Initially, we used JavaScript to fetch data from Wordpress via REST api. But, since this was not working in Safari on iPhone, I decided to quickly port the JavaScript to PHP. Debugging on iPhone was not possible due to limited time, and I already knew how to make it work in PHP – the port was done in about an hour or so.<\/p>\r\n\r\n<p>Ladyfingers have since changed their design, but it can still be viewed here on my portfolio site.<\/p>\r\n<\/section>\r\n\r\n<\/div>","last_modified":1544366414,"include_in_navigation":1}